Script started on 2020-10-22 20:24:31-07:00 [TERM="xterm-256color" TTY="/dev/pts/0" COLUMNS="80" LINES="24"]
]0;reaper@REAPER: ~/CS1B/06/s20[01;32mreaper@REAPER[00m:[01;34m~/CS1B/06/s20[00m$ make all
g++ -g s20.cpp s20f.o -o s20dbg
]0;reaper@REAPER: ~/CS1B/06/s20[01;32mreaper@REAPER[00m:[01;34m~/CS1B/06/s20[00m$ make clean
rm s20 *.o
]0;reaper@REAPER: ~/CS1B/06/s20[01;32mreaper@REAPER[00m:[01;34m~/CS1B/06/s20[00m$ make all
g++ -g -c s20f.cpp -o s20f.o
g++ -g s20.cpp s20f.o -o s20dbg
]0;reaper@REAPER: ~/CS1B/06/s20[01;32mreaper@REAPER[00m:[01;34m~/CS1B/06/s20[00m$ ls -la
total 120
drwxrwxr-x  2 reaper reaper  4096 Oct 22 20:24 [0m[01;34m.[0m
drwxrwxr-x 11 reaper reaper  4096 Oct 20 20:59 [01;34m..[0m
-rw-rw-r--  1 reaper reaper    52 Oct 20 20:47 hw06.h
-rw-rw-r--  1 reaper reaper   216 Oct 22 20:23 Makefile
-rw-rw-r--  1 reaper reaper   336 Oct 22 20:24 s20.cpp
-rwxrwxr-x  1 reaper reaper 53520 Oct 22 20:24 [01;32ms20dbg[0m
-rw-rw-r--  1 reaper reaper   192 Oct 20 20:47 s20f.cpp
-rw-rw-r--  1 reaper reaper 39360 Oct 22 20:24 s20f.o
-rw-rw-r--  1 reaper reaper     0 Oct 22 20:24 s20.scr
]0;reaper@REAPER: ~/CS1B/06/s20[01;32mreaper@REAPER[00m:[01;34m~/CS1B/06/s20[00m$ dbg[K[K[Kgdb s20dbg 
[35;1m[35;1mGNU gdb [m[35;1m(Ubuntu 9.2-0ubuntu1~20.04) [m[35;1m9.2[m[35;1m
[m[mCopyright (C) 2020 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from [32ms20dbg[m...
(gdb) list 1,23
1	#include "hw06.h"
2	
3	int main()
4	{
5	  int **d, s, i;
6	  d = new int *[5];
7	
8	  for (i = 0; i < 5; ++i)
9	    d[i] = new int[8];
10	
11	  for (int j = 0; j < 5; j++)
12	    for (int k = 0; k < 8; k++)
13	      d[j][k] = k;
14	
15	  s = Sum(d, 5, 8);
16	  std::cout << "s: " << s << std::endl;
17	
18	  for (i = 0; i < 5; ++i)
19	    delete[] d[i];
20	
21	  delete[] d;
22	  return 0;
23	}
(gdb) b 4
Breakpoint 1 at [34m0x1209[m: file [32ms20.cpp[m, line 4.
(gdb) b 15
Breakpoint 2 at [34m0x12a8[m: file [32ms20.cpp[m, line 15.
(gdb) s[Krun
Starting program: /home/reaper/CS1B/06/s20/s20dbg 

Breakpoint 1, [33mmain[m () at [32ms20.cpp[m:4
4	{
(gdb) s
6	  d = new int *[5];
(gdb) s
8	  for (i = 0; i < 5; ++i)
(gdb) p d
$1 = (int **) [34m0x55555556aeb0[m
(gdb) p &d
$2 = (int ***) [34m0x7fffffffded8[m
(gdb) p s
$3 = 0
(gdb) p &s
$4 = (int *) [34m0x7fffffffded4[m
(gdb) p i
$5 = 1431655600
(gdb) p &s[Ki
$6 = (int *) [34m0x7fffffffdec8[m
(gdb) s
9	    d[i] = new int[8];
(gdb) s
8	  for (i = 0; i < 5; ++i)
(gdb) s
9	    d[i] = new int[8];
(gdb) s
8	  for (i = 0; i < 5; ++i)
(gdb) continue
Continuing.

Breakpoint 2, [33mmain[m () at [32ms20.cpp[m:15
15	  s = Sum(d, 5, 8);
(gdb) p s
$7 = 0
(gdb) s
[33mSum[m ([36mp[m=0x7fffffffdef0, [36mr[m=0, [36mc[m=32) at [32ms20f.cpp[m:4
4	{
(gdb) p [K[Klist
1	#include "hw06.h"
2	
3	int Sum(int **p, int r, int c)
4	{
5	  int j, k, sum = 0;
6	  for (j = 0; j < r; ++j)
7	  {
8	    for (k = 0; k < c; ++k)
9	    {
10	      sum += *(*(p + j) + k);
(gdb) p p
$8 = (int **) [34m0x7fffffffdef0[m
(gdb) p *[K&p
$9 = (int ***) [34m0x7fffffffde98[m
(gdb) p **p
Cannot access memory at address 0x0
(gdb) p *p
$10 = (int *) [34m0x0[m
(gdb) p r
$11 = 0
(gdb) p c
$12 = 32
(gdb) p &r
$13 = (int *) [34m0x7fffffffde94[m
(gdb) p &c
$14 = (int *) [34m0x7fffffffde90[m
(gdb) s
5	  int j, k, sum = 0;
(gdb) p j
$15 = 21845
(gdb)  [Kp k
$16 = -135807959
(gdb) p sum
$17 = 32767
(gdb) s
6	  for (j = 0; j < r; ++j)
(gdb) p sum
$18 = 0
(gdb) s
8	    for (k = 0; k < c; ++k)
(gdb) s
10	      sum += *(*(p + j) + k);
(gdb) s
8	    for (k = 0; k < c; ++k)
(gdb) s
10	      sum += *(*(p + j) + k);
(gdb) p sum
$19 = 0
(gdb) s
8	    for (k = 0; k < c; ++k)
(gdb) p sum
$20 = 1
(gdb) s
10	      sum += *(*(p + j) + k);
(gdb) s
8	    for (k = 0; k < c; ++k)
(gdb) p sum
$21 = 3
(gdb) s 
10	      sum += *(*(p + j) + k);
(gdb) s
8	    for (k = 0; k < c; ++k)
(gdb) p sum
$22 = 6
(gdb) p[Ks
10	      sum += *(*(p + j) + k);
(gdb) s
8	    for (k = 0; k < c; ++k)
(gdb) p sum
$23 = 10
(gdb) s
10	      sum += *(*(p + j) + k);
(gdb) s
8	    for (k = 0; k < c; ++k)
(gdb) s
10	      sum += *(*(p + j) + k);
(gdb) s
8	    for (k = 0; k < c; ++k)
(gdb) p sum
$24 = 21
(gdb) continue
Continuing.
s: 140
[Inferior 1 (process 63102) exited normally]
(gdb) quit
]0;reaper@REAPER: ~/CS1B/06/s20[01;32mreaper@REAPER[00m:[01;34m~/CS1B/06/s20[00m$ exit
exit

Script done on 2020-10-22 20:26:48-07:00 [COMMAND_EXIT_CODE="0"]
